reseacher_name = input("Введите ФИО исследователя: ")
date = input("Введите дату: ")
experiment_name = input("Введите название эксперимента: ")
conclution = input("Введите вывод: ")

with open("C:/Users/Anna/Desktop/eremeeva_aa/projects_2/task_2_3/journal.txt", "w", encoding="utf-8") as file:
    file.write("+-------------------------------------------------------------------------------------------------------+\n")
    file.write("| Электронный лабораторный журнал \n")
    file.write("+-------------------------------------------------------------------------------------------------------+\n")
    file.write(f"| ФИО исследователя:\t{reseacher_name}\n| Дата:\t\t\t\t\t{date}\n| Эксперимент:\t\t\t{experiment_name}\n")
    file.write("+-------------------------------------------------------------------------------------------------------+\n")
    file.write(f"| Вывод:\n| {conclution}\n")
    file.write("+-------------------------------------------------------------------------------------------------------+\n")